Microchip-MPLAB-Harmony/csp/apps/ccl/manchester_encoder/firmware/src/packs/ATSAMC21N18A_DFP/component/ac.h
#define AC_INTENCLR_COMP0_Pos                 _U_(0)                                               /**< (AC_INTENCLR) Comparator 0 Interrupt Enable Position */
#define AC_INTENCLR_COMP0_Msk                 (_U_(0x1) << AC_INTENCLR_COMP0_Pos)                  /**< (AC_INTENCLR) Comparator 0 Interrupt Enable Mask */
#define AC_INTENCLR_COMP0(value)              (AC_INTENCLR_COMP0_Msk & ((value) << AC_INTENCLR_COMP0_Pos))
#define AC_INTENCLR_COMP1_Pos                 _U_(1)                                               /**< (AC_INTENCLR) Comparator 1 Interrupt Enable Position */
#define AC_INTENCLR_COMP1_Msk                 (_U_(0x1) << AC_INTENCLR_COMP1_Pos)                  /**< (AC_INTENCLR) Comparator 1 Interrupt Enable Mask */
#define AC_INTENCLR_COMP1(value)              (AC_INTENCLR_COMP1_Msk & ((value) << AC_INTENCLR_COMP1_Pos))
#define AC_INTENCLR_COMP2_Pos                 _U_(2)                                               /**< (AC_INTENCLR) Comparator 2 Interrupt Enable Position */
#define AC_INTENCLR_COMP2_Msk                 (_U_(0x1) << AC_INTENCLR_COMP2_Pos)                  /**< (AC_INTENCLR) Comparator 2 Interrupt Enable Mask */
#define AC_INTENCLR_COMP2(value)              (AC_INTENCLR_COMP2_Msk & ((value) << AC_INTENCLR_COMP2_Pos))
#define AC_INTENCLR_COMP3_Pos                 _U_(3)                                               /**< (AC_INTENCLR) Comparator 3 Interrupt Enable Position */
#define AC_INTENCLR_COMP3_Msk                 (_U_(0x1) << AC_INTENCLR_COMP3_Pos)                  /**< (AC_INTENCLR) Comparator 3 Interrupt Enable Mask */
#define AC_INTENCLR_COMP3(value)              (AC_INTENCLR_COMP3_Msk & ((value) << AC_INTENCLR_COMP3_Pos))
#define AC_INTENCLR_WIN0_Pos                  _U_(4)                                               /**< (AC_INTENCLR) Window 0 Interrupt Enable Position */
#define AC_INTENCLR_WIN0_Msk                  (_U_(0x1) << AC_INTENCLR_WIN0_Pos)                   /**< (AC_INTENCLR) Window 0 Interrupt Enable Mask */
#define AC_INTENCLR_WIN0(value)               (AC_INTENCLR_WIN0_Msk & ((value) << AC_INTENCLR_WIN0_Pos))
#define AC_INTENCLR_WIN1_Pos                  _U_(5)                                               /**< (AC_INTENCLR) Window 1 Interrupt Enable Position */
#define AC_INTENCLR_WIN1_Msk                  (_U_(0x1) << AC_INTENCLR_WIN1_Pos)                   /**< (AC_INTENCLR) Window 1 Interrupt Enable Mask */
#define AC_INTENCLR_WIN1(value)               (AC_INTENCLR_WIN1_Msk & ((value) << AC_INTENCLR_WIN1_Pos))
#define AC_INTENCLR_Msk                       _U_(0x3F)                                            /**< (AC_INTENCLR) Register Mask  */

#define AC_INTENCLR_COMP_Pos                  _U_(0)                                               /**< (AC_INTENCLR Position) Comparator x Interrupt Enable */
#define AC_INTENCLR_COMP_Msk                  (_U_(0xF) << AC_INTENCLR_COMP_Pos)                   /**< (AC_INTENCLR Mask) COMP */
#define AC_INTENCLR_COMP(value)               (AC_INTENCLR_COMP_Msk & ((value) << AC_INTENCLR_COMP_Pos)) 
#define AC_INTENCLR_WIN_Pos                   _U_(4)                                               /**< (AC_INTENCLR Position) Window x Interrupt Enable */
#define AC_INTENCLR_WIN_Msk                   (_U_(0x3) << AC_INTENCLR_WIN_Pos)                    /**< (AC_INTENCLR Mask) WIN */
#define AC_INTENCLR_WIN(value)                (AC_INTENCLR_WIN_Msk & ((value) << AC_INTENCLR_WIN_Pos)) 

/* -------- AC_INTENSET : (AC Offset: 0x05) (R/W 8) Interrupt Enable Set -------- */
#define AC_INTENSET_RESETVALUE                _U_(0x00)                                            /**<  (AC_INTENSET) Interrupt Enable Set  Reset Value */

#define AC_INTENSET_COMP0_Pos                 _U_(0)                                               /**< (AC_INTENSET) Comparator 0 Interrupt Enable Position */
#define AC_INTENSET_COMP0_Msk                 (_U_(0x1) << AC_INTENSET_COMP0_Pos)                  /**< (AC_INTENSET) Comparator 0 Interrupt Enable Mask */
#define AC_INTENSET_COMP0(value)              (AC_INTENSET_COMP0_Msk & ((value) << AC_INTENSET_COMP0_Pos))
#define AC_INTENSET_COMP1_Pos                 _U_(1)                                               /**< (AC_INTENSET) Comparator 1 Interrupt Enable Position */
#define AC_INTENSET_COMP1_Msk                 (_U_(0x1) << AC_INTENSET_COMP1_Pos)                  /**< (AC_INTENSET) Comparator 1 Interrupt Enable Mask */
#define AC_INTENSET_COMP1(value)              (AC_INTENSET_COMP1_Msk & ((value) << AC_INTENSET_COMP1_Pos))
#define AC_INTENSET_COMP2_Pos                 _U_(2)                                               /**< (AC_INTENSET) Comparator 2 Interrupt Enable Position */
#define AC_INTENSET_COMP2_Msk                 (_U_(0x1) << AC_INTENSET_COMP2_Pos)                  /**< (AC_INTENSET) Comparator 2 Interrupt Enable Mask */
#define AC_INTENSET_COMP2(value)              (AC_INTENSET_COMP2_Msk & ((value) << AC_INTENSET_COMP2_Pos))
#define AC_INTENSET_COMP3_Pos                 _U_(3)                                               /**< (AC_INTENSET) Comparator 3 Interrupt Enable Position */
#define AC_INTENSET_COMP3_Msk                 (_U_(0x1) << AC_INTENSET_COMP3_Pos)                  /**< (AC_INTENSET) Comparator 3 Interrupt Enable Mask */
#define AC_INTENSET_COMP3(value)              (AC_INTENSET_COMP3_Msk & ((value) << AC_INTENSET_COMP3_Pos))
#define AC_INTENSET_WIN0_Pos                  _U_(4)                                               /**< (AC_INTENSET) Window 0 Interrupt Enable Position */
#define AC_INTENSET_WIN0_Msk                  (_U_(0x1) << AC_INTENSET_WIN0_Pos)                   /**< (AC_INTENSET) Window 0 Interrupt Enable Mask */
#define AC_INTENSET_WIN0(value)               (AC_INTENSET_WIN0_Msk & ((value) << AC_INTENSET_WIN0_Pos))
#define AC_INTENSET_WIN1_Pos                  _U_(5)                                               /**< (AC_INTENSET) Window 1 Interrupt Enable Position */
#define AC_INTENSET_WIN1_Msk                  (_U_(0x1) << AC_INTENSET_WIN1_Pos)                   /**< (AC_INTENSET) Window 1 Interrupt Enable Mask */
#define AC_INTENSET_WIN1(value)               (AC_INTENSET_WIN1_Msk & ((value) << AC_INTENSET_WIN1_Pos))
#define AC_INTENSET_Msk                       _U_(0x3F)                                            /**< (AC_INTENSET) Register Mask  */

